app/views/users/show.html.erb

<h2>Last.fm user <%= @user.username_lastfm %>'s Top Artists on Twitter:</h2>
<!-- Entry.where(:user_id => 9).map{|e| e.artist.twitter_handle}
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 18