app/controllers/users_controller.rb

  def new
    user = User.find_by_fb_nickname("dealville")
---
SELECT "users".* FROM "users" WHERE "users"."fb_nickname" = 'dealville' LIMIT 1

  def show
    @user = User.find(params[:id])

    ### WET:
    # @list = Entry.where(:user_id => params[:id]).map{|e| e.artist.twitter_handle}

    ### DRY:
    @list = @user.entries.map{|e| e.artist.twitter_handle}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "18"]]
SELECT "artists".* FROM "artists" WHERE "artists"."id" = 531 LIMIT 1
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 18

  def create
    unless User.where(username_lastfm: params[:username]).first
      @user = User.create(username_lastfm: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username_lastfm_id" = 'mitchdelgado' LIMIT 1
INSERT INTO "users" ("created_at", "updated_at", "username_lastfm") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 15 Jan 2014 19:14:10 UTC +00:00], ["updated_at", Wed, 15 Jan 2014 19:14:10 UTC +00:00], ["username_lastfm", "test"]]

  def last_fm
    username = params[:username]
    data = HTTParty.get("http://ws.audioscrobbler.com/2.0/?method=user.gettopartists&user=#{username}&api_key=fb7ce62e972081cc10c6b22701a9e9b7&format=json")

    artist_list = {}
    # binding.pry
    data["topartists"]["artist"][0..9].each do |object|
      artist_name = object["name"]
      url_encoded = URI.encode("http://developer.echonest.com/api/v4/artist/twitter?api_key=WUYSVVEOELXPZXCN8&name=#{artist_name}")
      data_echonest = HTTParty.get(url_encoded)
        if ((data_echonest["response"]) && (data_echonest["response"]["artist"]) && (data_echonest["response"]["artist"]["twitter"]))
          twitter_name = data_echonest["response"]["artist"]["twitter"]
          else
            twitter_name = ""
        end
        playcount = object["playcount"].to_i
      artist_list[artist_name.to_sym] = [twitter_name, playcount]
    end
    # binding.pry
    @artist_list = artist_list

    ###facebook here
    user = User.find_by_fb_nickname("dealville")
---
SELECT "artists".* FROM "artists" WHERE "artists"."name" = 'The Beatles' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."fb_nickname" = 'dealville' LIMIT 1